# Taps
tap 'ekvedaras/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'nicoverbruggen/homebrew-cask'
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "shopify/shopify"

# Binaries
brew 'asimov', restart_service: true
brew 'bash' # Latest Bash version
brew 'btop'
brew 'coreutils' # Those that come with macOS are outdated
brew 'fish'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'ocrmypdf'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew "gradle"
brew "httpd"
brew "optipng"
brew "parallel"
brew "pinentry-mac"
brew "svgo"
brew "wp-cli"

# Spatie Medialibrary
brew 'gifsicle'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'

# Development
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'mailhog', restart_service: true
brew 'meilisearch', restart_service: true
brew 'memcached'
brew 'mysql', restart_service: true
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'php'
brew 'php@7.2'
brew 'php@7.4'
brew 'php@8.0'
brew 'phpmon'
brew 'redis'
brew 'starship'
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "shivammathur/extensions/redis@7.2"
brew "shivammathur/extensions/xdebug@7.2"
brew "shopify/shopify/themekit"

# Apps
# cask '1password'
# cask '1password-cli'
# cask 'aerial'
# cask 'caffeine'
# cask 'dbngin'
# cask 'alfred'
# cask 'cleanshot'
# cask 'pastebot'
cask 'brave-browser'
cask 'clickup'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'enpass'
cask 'figma'
cask 'firefox'
cask 'hazel'
cask 'iina'
cask 'imageoptim'
cask 'invoker'
cask 'keka'
cask 'moneymoney'
cask 'notion'
cask 'postbox'
cask 'raycast'
cask 'rocket'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'swish'
cask 'tableplus'
cask 'tinkerwell'
cask 'toggl-track'
cask 'transmit'
cask 'visual-studio-code'
cask "alt-tab"
cask "bartender"
cask "bettertouchtool"
cask "eloston-chromium"
cask "font-fira-code"
cask "microsoft-teams"
cask "pdf-squeezer"
cask "phpmon"
cask "phpstorm"
cask "stats"
cask "telegram"
cask "whatsapp"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'

# Mac App Store
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641m
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005

mas "ColorSlurp", id: 1287239339
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# mas 'petrify', id: 145117798
# mas 'Rank Guru', id: 662946309
