# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'asimov'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'fish'
# brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
#brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'phpmon'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'mariadb'
brew 'mailhog'
brew 'meilisearch'
brew 'memcached'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'redis'
brew 'starship'

# Apps
# cask '1password'
# cask '1password-cli'
# cask 'aerial'
# cask 'caffeine'
# cask 'dbngin'
cask 'alfred'
cask 'cleanshot'
cask 'bartender'
cask 'brave-browser'
cask 'clickup'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'enpass'
cask 'figma'
cask 'firefox'
cask 'hazel'
cask 'invoker'
cask 'imageoptim'
cask 'notion'
# cask 'pastebot'
# cask 'phpmon'
cask 'phpstorm'
cask 'rambox'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'toggl-track'
cask 'transmit'
cask 'visual-studio-code'

cask 'numi'
cask 'keka'

cask 'moneymoney'
cask 'swish'
cask 'forklift'
# cask 'sip'
# cask 'tyme'
# cask 'banking-4'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'

# Mac App Store
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641m
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005

mas 'ColorSlurp', id: 1287239339
# mas 'petrify', id: 145117798
# mas 'Rank Guru', id: 662946309
